<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Microsoft Azure Storage Explorer and creates a package.</string>
        <key>Identifier</key>
        <string>com.github.macmiller.pkg.MicrosoftAzureStorageExplorer</string>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft Azure Storage Explorer</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.macmiller.download.MicrosoftAzureStorageExplorer</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>app_path</key>
                    <string>%RECIPE_CACHE_DIR%/extract/%NAME%.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/extract</string>
                        <string>%RECIPE_CACHE_DIR%/payload</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
