<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Elastic packetbeat</string>
	<key>Identifier</key>
	<string>com.github.macmiller.download.packetbeat</string>
	<key>Input</key>
	<dict>
		<key>BEAT_NAME</key>
		<string>packetbeat</string>
		<key>NAME</key>
		<string>packetbeat</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.macmiller.download.elasticbeat</string>
	<key>Process</key>
	<array>
	</array>
</dict>
</plist>
