<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft Azure Storage Explorer and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.macmiller.pkg.MicrosoftAzureStorageExplorer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft Azure Storage Explorer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.macmiller.download.MicrosoftAzureStorageExplorer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Microsoft Azure Storage Explorer.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Microsoft Azure Storage Explorer.app</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/MicrosoftAzureStorageExplorer-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/downloads</string>
                  <string>%RECIPE_CACHE_DIR%/payload</string>
               </array>
            </dict>
         </dict>
	</array>
</dict>
</plist>
